---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.AnalyticalElement
source: html/b0cabddf-82a0-7827-1931-11edd8b182e8.htm
---
# AnalyticalElement Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.